using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.Configuration;
using System.IO;
using System.Linq;
using System.Text;
using System.Windows.Forms;
using System.Xml.Serialization;

namespace WaveletApplication
{
    public class WaveletLoader
    {
        private string _libDir;
        private Collection<WaveletSettings> _activeWaveletSettings { get; set; }   
        public WaveletLoader()
        {
            _libDir = Properties.Settings.Default.WLibraryDir;
            _activeWaveletSettings = new Collection<WaveletSettings>();
        }

        public void LoadWaveletSettings()
        {
                var ser = new XmlSerializer(typeof(WaveletSettings));
            if (Directory.Exists(_libDir))
            {
                var files = Directory.GetFiles(_libDir, "*.xml");
                foreach (var file in files)
                {
                    var ws = new WaveletSettings();
                    using (FileStream fs = File.OpenRead(file))
                    {
                        try
                        {
                            ws = (WaveletSettings) ser.Deserialize(fs);

                        }
                        catch (Exception e)
                        {
                            MessageBox.Show(e.Message, "Файл настройки вейвлета испорчен");
                            continue;
                        }

                    }
                    _activeWaveletSettings.Add(ws);
                }
            }
            
        }

        public void SaveWaveletSettings(WaveletSettings ws)
        {
            var s = new System.Xml.Serialization.XmlSerializer(typeof(WaveletSettings));
            var ns = new System.Xml.Serialization.XmlSerializerNamespaces();
            ns.Add("", "");
            //TODO: убрать скаляр
            System.IO.StreamWriter writer = System.IO.File.CreateText(_libDir + "\\test.xml");
            s.Serialize(writer, ws, ns);
            writer.Close();
        }

        public List<string> GetWaveletsNames
        {
            get
            {
                return _activeWaveletSettings.AsEnumerable().Select(x => x.WaveletName).ToList();

            }
        }

        public WaveletSettings GetWaveletByName(string name)
        {
            return _activeWaveletSettings.AsEnumerable().SingleOrDefault(x => x.WaveletName.Equals(name));
        }



        //private string _currentWavelet;
        //public string CurrentWatelet
        //{
        //    get { return _currentWavelet; }
        //    set
        //    {
        //        _currentWavelet = value;
        //        //CurrentWavelet = GetCurrentWavelet(value);
        //    }
        //}
        //private WaveletStorage currentWavelet;
        //public WaveletStorage CurrentWavelet
        //{
        //    get
        //    {
        //        //GetCurrentWavelet(CurrentWatelet);
        //        return GetCurrentWavelet(CurrentWatelet);

        //    }
        //    private set
        //    {
        //        currentWavelet = value;
        //    }

        //}

        //private WaveletSettings GetCurrentWavelet(string CurrentWateletName)
        //{
        //    switch (CurrentWateletName)
        //    {
        //        case "Daubechies_2":
        //            return new WaveletSettings(
        //            "Добеши 2", "4 коэффициентов (ортоганальный)",
        //                //// <summary>
        //                //// Фильтр декомпозиции НЧ (Добеши 2)
        //                //// </summary>
        //            new double[4]
        //            {
        //                -0.12940952255126,
        //                0.224143868042013,
        //                0.836516303737808,
        //                0.482962913144534
        //            },
        //                ///// <summary>
        //                ///// Фильтр декомпозиции ВЧ (Добеши 2)
        //                ///// </summary>
        //            new double[4]
        //            {

        //                -0.482962913144534,
        //                0.836516303737808,
        //                -0.224143868042013,
        //                -0.12940952255126

        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции НЧ (Добеши 2)
        //                ///// </summary>
        //            new double[4]
        //            {
        //                0.482962913144534,
        //                0.836516303737808,
        //                0.224143868042013,
        //                -0.12940952255126

        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции ВЧ (Добеши 2)
        //                ///// </summary>
        //            new double[4] 
        //            {
        //                -0.12940952255126,
        //                -0.224143868042013,
        //                0.836516303737808,
        //                -0.482962913144534

        //              }

        //                                                        );
        //            break;
        //        /////////
        //        case "Daubechies_6":
        //            return new WaveletSettings(
        //            "Добеши 6", "12 коэффициентов (ортоганальный)",
        //                //// <summary>
        //                //// Фильтр декомпозиции НЧ (Добеши 6)
        //                //// </summary>
        //            new double[12]
        //            {
        //                -0.00107730108530848,
        //                0.00477725751094552,
        //                0.000553842201161487,
        //                -0.0315820393174861,
        //                0.0275228655303058,
        //                0.0975016055873234,
        //                -0.129766867567262,
        //                -0.22626469396544,
        //                0.315250351709197,
        //                0.751133908021095,
        //                0.494623890398453,
        //                0.11154074335011
        //            },
        //                ///// <summary>
        //                ///// Фильтр декомпозиции ВЧ (Добеши 6)
        //                ///// </summary>
        //            new double[12]
        //            {
        //                -0.11154074335011,
        //                0.494623890398453,
        //                -0.751133908021095,
        //                0.315250351709197,
        //                0.22626469396544,
        //                -0.129766867567262,
        //                -0.0975016055873234,
        //                0.0275228655303058,
        //                0.0315820393174861,
        //                0.000553842201161487,
        //                -0.00477725751094552,
        //                -0.00107730108530848
        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции НЧ (Добеши 6)
        //                ///// </summary>
        //            new double[12]
        //            {
        //                0.11154074335011,
        //                0.494623890398453,
        //                0.751133908021095,
        //                0.315250351709197,
        //                -0.22626469396544,
        //                -0.129766867567262,
        //                0.0975016055873234,
        //                0.0275228655303058,
        //                -0.0315820393174861,
        //                0.000553842201161487,
        //                0.00477725751094552,
        //                -0.00107730108530848
        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции ВЧ (Добеши 6)
        //                ///// </summary>
        //            new double[12] 
        //            {
        //                -0.00107730108530848,
        //                -0.00477725751094552,
        //                0.000553842201161487,
        //                0.0315820393174861,
        //                0.0275228655303058,
        //                -0.0975016055873234,
        //                -0.129766867567262,
        //                0.22626469396544,
        //                0.315250351709197,
        //                -0.751133908021095,
        //                0.494623890398453,
        //                -0.11154074335011
        //            }

        //                                                        );
        //            break;
        //        /////////
        //        case "Daubechies_7":
        //            return new WaveletSettings(
        //            "Добеши 7", "14 коэффициентов (ортоганальный)",
        //                //// <summary>
        //                //// Фильтр декомпозиции НЧ (Добеши 7)
        //                //// </summary>
        //            new double[14]
        //            {
        //                0.00035371379997452,
        //                -0.00180164070404749,
        //                0.000429577972921365,
        //                0.0125509985560999,
        //                -0.0165745416306669,
        //                -0.0380299369350144,
        //                0.0806126091510832,
        //                0.0713092192668305,
        //                -0.224036184993875,
        //                -0.143906003928565,
        //                0.469782287405193,
        //                0.729132090846235,
        //                0.396539319481917,
        //                0.0778520540850092
        //            },
        //                ///// <summary>
        //                ///// Фильтр декомпозиции ВЧ (Добеши 7)
        //                ///// </summary>
        //            new double[14]
        //            {
        //                -0.0778520540850092,
        //                0.396539319481917,
        //                -0.729132090846235,
        //                0.469782287405193,
        //                0.143906003928565,
        //                -0.224036184993875,
        //                -0.0713092192668305,
        //                0.0806126091510832,
        //                0.0380299369350144,
        //                -0.0165745416306669,
        //                -0.0125509985560999,
        //                0.000429577972921365,
        //                0.00180164070404749,
        //                0.00035371379997452
        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции НЧ (Добеши 7)
        //                ///// </summary>
        //            new double[14]
        //            {
        //                0.0778520540850092,
        //                0.396539319481917,
        //                0.729132090846235,
        //                0.469782287405193,
        //                -0.143906003928565,
        //                -0.224036184993875,
        //                0.0713092192668305,
        //                0.0806126091510832,
        //                -0.0380299369350144,
        //                -0.0165745416306669,
        //                0.0125509985560999,
        //                0.000429577972921365,
        //                -0.00180164070404749,
        //                0.00035371379997452
        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции ВЧ (Добеши 7)
        //                ///// </summary>
        //            new double[14] 
        //            {
        //                0.00035371379997452,
        //                0.00180164070404749,
        //                0.000429577972921365,
        //                -0.0125509985560999,
        //                -0.0165745416306669,
        //                0.0380299369350144,
        //                0.0806126091510832,
        //                -0.0713092192668305,
        //                -0.224036184993875,
        //                0.143906003928565,
        //                0.469782287405193,
        //                -0.729132090846235,
        //                0.396539319481917,
        //                -0.0778520540850092
        //            }

        //                                                        );
        //            break;
        //        /////////
        //        case "Daubechies_8":
        //            return new WaveletSettings(
        //            "Добеши 8", "16 коэффициентов (ортоганальный)",
        //                //// <summary>
        //                //// Фильтр декомпозиции НЧ (Добеши 8)
        //                //// </summary>
        //            new double[16]
        //            {
        //                -0.000117476784124771,
        //                0.000675449406450575,
        //                -0.000391740373376947,
        //                -0.00487035299345161,
        //                0.00874609404740583,
        //                0.0139810279173984,
        //                -0.0440882539307954,
        //                -0.0173693010018086,
        //                0.128747426620478,
        //                0.00047248457391276,
        //                -0.28401554296155,
        //                -0.0158291052563512,
        //                0.585354683654209,
        //                0.675630736297293,
        //                0.312871590914302,
        //                0.0544158422431043
        //            },
        //                ///// <summary>
        //                ///// Фильтр декомпозиции ВЧ (Добеши 8)
        //                ///// </summary>
        //            new double[16]
        //            {
        //                -0.0544158422431043,
        //                0.312871590914302,
        //                -0.675630736297293,
        //                0.585354683654209,
        //                0.0158291052563512,
        //                -0.28401554296155,
        //                -0.00047248457391276,
        //                0.128747426620478,
        //                0.0173693010018086,
        //                -0.0440882539307954,
        //                -0.0139810279173984,
        //                0.00874609404740583,
        //                0.00487035299345161,
        //                -0.000391740373376947,
        //                -0.000675449406450575,
        //                -0.000117476784124771
        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции НЧ (Добеши 8)
        //                ///// </summary>
        //            new double[16]
        //            {
        //                0.0544158422431043,
        //                0.312871590914302,
        //                0.675630736297293,
        //                0.585354683654209,
        //                -0.0158291052563512,
        //                -0.28401554296155,
        //                0.00047248457391276,
        //                0.128747426620478,
        //                -0.0173693010018086,
        //                -0.0440882539307954,
        //                0.0139810279173984,
        //                0.00874609404740583,
        //                -0.00487035299345161,
        //                -0.000391740373376947,
        //                0.000675449406450575,
        //                -0.000117476784124771
        //            },
        //                ///// <summary>
        //                ///// Фильтр реконструкции ВЧ (Добеши 8)
        //                ///// </summary>
        //            new double[16] 
        //            {
        //                -0.000117476784124771,
        //                -0.000675449406450575,
        //                -0.000391740373376947,
        //                0.00487035299345161,
        //                0.00874609404740583,
        //                -0.0139810279173984,
        //                -0.0440882539307954,
        //                0.0173693010018086,
        //                0.128747426620478,
        //                -0.00047248457391276,
        //                -0.28401554296155,
        //                0.0158291052563512,
        //                0.585354683654209,
        //                -0.675630736297293,
        //                0.312871590914302,
        //                -0.0544158422431043
        //            }

        //                                                        );
        //            break;

        //        default:
        //            return null;

        //    }
        //}


    }

}
